"""
Создайте модуль main.py. Из модулей реализованных в заданиях 1 и 2 сделайте импорт в main.py всех функций.
Вызовите каждую функцию в main.py и проверьте что все работает как надо.

"""

from Homework_4_1 import rand_el
from Homework_3_1 import add_fold, rem_fold

# add_fold()
# rem_fold()

nums = []
print(rand_el(nums))