"""
Python позволяет нам поместить классы, функции а также отдельные скрипты в отдельный файл и использовать в других
проектах (программах)
модулем может являться любой файл с программой python
Зачем нам модули? Для повторного использования кода, для управления пространством имен, для разделения проекта на
мелкие части
Встроенные модули: math, random... сторонний Django, PyQt5, свои (py файл)

import math (либо import math as mt
from math import sin,cos
"""

import math
from random import randint, randrange
print(math.pi)

